podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN1_S32K14x.svd.xml
               <register>
                  <dim>$(FILTER_COUNT)</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FILTER_ID_B</name>
                  <description>FIFO Message Filter ID (format B)</description>
                  <addressOffset>0x60</addressOffset>
                  <resetMask>0xFFFF</resetMask>
                  <fields>
                     <field>
                        <name>RXIDB_EXT_1</name>
                        <?ignoreOverlap?>
                        <description>Rx Frame Identifier (Extended Format)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>RXIDB_STD_1</name>
                        <?ignoreOverlap?>
                        <description>Rx Frame Identifier (Standard Format)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>IDEB_1</name>
                        <description>Extended Frame</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Standard</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Extended</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RTRB_1</name>
                        <description>Remote Frame</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Data frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Remote Request frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field derivedFrom="RXIDB_EXT_1" > <name>RXIDB_EXT_0</name> <bitOffset>16</bitOffset> <?ignoreOverlap?> </field>
                     <field derivedFrom="RXIDB_STD_1" > <name>RXIDB_STD_0</name> <bitOffset>19</bitOffset> <?ignoreOverlap?> </field>
                     <field derivedFrom="IDEB_1" > <name>IDEB_0</name> <bitOffset>30</bitOffset> </field>
                     <field derivedFrom="RTRB_1" > <name>RTRB_0</name> <bitOffset>31</bitOffset> </field>
                  </fields>
               </register>
               <register>
                  <dim>$(FILTER_COUNT)</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FILTER_ID_C</name>
                  <description>FIFO Message Filter ID (format C)</description>
                  <addressOffset>0x60</addressOffset>
                  <resetMask>0xFF</resetMask>
                  <fields>
                     <field>
                        <name>RXIDC_3</name>
                        <description>Rx Frame Identifier</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field derivedFrom="RXIDC_3" > <name>RXIDC_2</name> <bitOffset>8</bitOffset> </field>
                     <field derivedFrom="RXIDC_3" > <name>RXIDC_1</name> <bitOffset>16</bitOffset> </field>
                     <field derivedFrom="RXIDC_3" > <name>RXIDC_0</name> <bitOffset>24</bitOffset> </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>$(MESSAGE_BUFFER_COUNT)</dim>
               <dimIncrement>16</dimIncrement>
               <name>MB,@p@f@i</name>
               <addressOffset>0x80</addressOffset>
               <?isolate?>
               <register>
                  <name>CS</name>
                  <description>Message Buffer 0 CS Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>TIME_STAMP</name>
                        <description>Free-Running Counter Time stamp.\tThis 16-bit field is a copy of the Free-Running Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field appears on the CAN bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DLC</name>
                        <description>Length of the data to be received/transmitted</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Data frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Remote Request frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended.\t Selects format frame</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Standard</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Extended</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Dominant is not a valid value</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Recessive value is compulsory</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CODE</name>
                        <description>Message Buffer Code</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0000</name>
                              <description>Inactive</description>
                              <value>0b0000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0bXXX1</name>
                              <description>Busy</description>
                              <value>0bXXX1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b0100</name>
                              <description>RxEmpty</description>
                              <value>0b0100</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b0010</name>
                              <description>RxFull</description>
                              <value>0b0010</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b0110</name>
                              <description>Overrun</description>
                              <value>0b0110</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1010</name>
                              <description>RxAnswer</description>
                              <value>0b1010</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1000</name>
                              <description>TxInactive</description>
                              <value>0b1000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1001</name>
                              <description>TxAbort</description>
                              <value>0b1001</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1100</name>
                              <description>TxData</description>
                              <value>0b1100</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1100</name>
                              <description>TxRemote</description>
                              <value>0b1100</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1110</name>
                              <description>TxAnswer</description>
                              <value>0b1110</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ESI</name>
                        <description>Error State Indicator</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Error Active</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Error Passive</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BRS</name>
                        <description>Bit Rate Switch</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No switch</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Switch allowed</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EDL</name>
                        <description>Extended Data Length</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Standard data length</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Extended data length</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ID</name>
                  <description>Message Buffer 0 ID Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>EXT</name>
                        <description>Extended identifier</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                     <field>
                        <name>STD</name>
                        <?ignoreOverlap?>
                        <description>Standard identifier</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>PRIO</name>
                        <description>Local priority. 
This 3-bit fieldis only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD0</name>
                  <description>Message Buffer 0 WORD0 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_3</name>
                        <description>Data byte 3 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_2</name>
                        <description>Data byte 2 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_1</name>
                        <description>Data byte 1 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_0</name>
                        <description>Data byte 0 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD1</name>
                  <description>Message Buffer 0 WORD1 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_7</name>
                        <description>Data byte 7 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_6</name>
                        <description>Data byte 6 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_5</name>
                        <description>Data byte 5 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_4</name>
                        <description>Data byte 4 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>$(MESSAGE_BUFFER_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>RXIMR%s</name>
               <description>Rx Individual Mask</description>
               <addressOffset>0x880</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>MI</name>
                     <description>Individual Mask Bits</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The corresponding bit in the filter is &quot;don&apos;t care.&quot;</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The corresponding bit in the filter is checked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
